{
    "app_version": "0.3.10",
    "method": 6,
    "class_id": 13,
    "class_name": "Illusionist",
    "attr": {
        "st": {
            "score": 15,
            "atk_mod": 1,
            "dmg_adj": 1,
            "test": 3,
            "feat": 16
        },
        "dx": {
            "score": 15,
            "atk_mod": 1,
            "def_adj": 1,
            "test": 3,
            "feat": 24
        },
        "cn": {
            "score": 16,
            "hp_adj": 1,
            "poison_adj": 1,
            "trauma_surv": 85,
            "test": 3,
            "feat": 16
        },
        "in": {
            "score": 12,
            "lang": 0,
            "bonus_spells": 0,
            "learn_spell": 50
        },
        "ws": {
            "score": 11,
            "will_adj": 0,
            "bonus_spells": 0,
            "learn_spell": 50
        },
        "ch": {
            "score": 11,
            "react_adj": 0,
            "max_henchmen": 4,
            "turn_adj": 0
        }
    },
    "xp": 320000,
    "level": 9,
    "xp_to_next": 480000,
    "xp_bonus": false,
    "alignment": {
        "align_id": 4,
        "short_name": "LG",
        "long_name": "Lawful Good"
    },
    "deity": {
        "deity_id": 2,
        "deity_name": "Artemis",
        "primary_alignment": "Lawful"
    },
    "race_id": 2,
    "race": "Amazon",
    "gender": "Female",
    "secondary_skill": "gardener",
    "hd": "9d4",
    "hp": 30,
    "fa": 4,
    "ca": 9,
    "ta": 0,
    "sv": 12,
    "sv_bonus": {
        "death": 0,
        "transformation": 0,
        "device": 2,
        "avoidance": 0,
        "sorcery": 2
    },
    "combat_matrix": {
        "-9": 25,
        "-8": 24,
        "-7": 23,
        "-6": 22,
        "-5": 21,
        "-4": 20,
        "-3": 19,
        "-2": 18,
        "-1": 17,
        "0": 16,
        "1": 15,
        "2": 14,
        "3": 13,
        "4": 12,
        "5": 11,
        "6": 10,
        "7": 9,
        "8": 8,
        "9": 7
    },
    "name": "",
    "armour": {
        "armour_id": 1,
        "armour_type": "None",
        "ac": 9,
        "dr": 0,
        "weight_class": null,
        "mv": 40,
        "cost": null,
        "weight": null,
        "description": null
    },
    "shield": null,
    "ac": 8,
    "mv": 40,
    "weapons_melee": [
        {
            "weapon_id": 109,
            "weapon_type": "Silver Dagger",
            "wc": 1,
            "hurlable": true,
            "hurled_rof": "3/2",
            "range_sml": "10/20/30",
            "damage": "1d4",
            "damage_2h": null,
            "cost": 25,
            "weight": 1,
            "qty": 1,
            "atk_rate": "1/1",
            "melee_atk": 1,
            "hurled_atk": 1,
            "dmg_adj": 1,
            "mastery": false
        },
        {
            "weapon_id": 126,
            "weapon_type": "Quarterstaff",
            "wc": 3,
            "hurlable": false,
            "hurled_rof": null,
            "range_sml": null,
            "damage": "1d6",
            "damage_2h": null,
            "cost": 5,
            "weight": 5,
            "qty": 1,
            "atk_rate": "1/1",
            "melee_atk": 1,
            "hurled_atk": null,
            "dmg_adj": 1,
            "mastery": false
        }
    ],
    "weapons_missile": [
        {
            "weapon_id": 216,
            "weapon_type": "Sling",
            "rof": "1/1",
            "range_sml": "50/100/150",
            "damage": "1d4",
            "hurled": false,
            "launched": true,
            "cost": 2,
            "weight": 1,
            "qty": 1,
            "ammunition": "bullets ×20",
            "missile_atk": 1,
            "dmg_adj": 0,
            "mastery": false
        }
    ],
    "equipment": [
        "backpack",
        "bandages",
        "winter blanket",
        "chalk (piece)",
        "ink and quill",
        "hooded lantern",
        "silver mirror",
        "lamp oil ×2",
        "parchment ×3",
        "soft leather pouch",
        "iron rations (1 week)",
        "silk rope (50-ft.)",
        "small sack",
        "tinderbox",
        "wineskin (full)",
        "writing stick",
        "spell book"
    ],
    "money": {
        "pp": 0,
        "gp": 3,
        "ep": 0,
        "sp": 0,
        "cp": 0
    },
    "favoured_weapons": {
        "any": false,
        "weapons_melee": [
            {
                "weapon_id": 108,
                "weapon_type": "Dagger",
                "wc": 1,
                "hurlable": 1,
                "hurled_rof": "3/2",
                "range_sml": "10/20/30",
                "damage": "1d4",
                "damage_2h": null,
                "cost": 4,
                "weight": 1
            },
            {
                "weapon_id": 126,
                "weapon_type": "Quarterstaff",
                "wc": 3,
                "hurlable": 0,
                "hurled_rof": null,
                "range_sml": null,
                "damage": "1d6",
                "damage_2h": null,
                "cost": 5,
                "weight": 5
            }
        ],
        "weapons_missile": [
            {
                "weapon_id": 203,
                "weapon_type": "Dart",
                "rof": "2/1",
                "range_sml": "15/30/45",
                "damage": "1d3",
                "hurled": 1,
                "launched": 0,
                "cost": 1,
                "weight": 1
            },
            {
                "weapon_id": 216,
                "weapon_type": "Sling",
                "rof": "1/1",
                "range_sml": "50/100/150",
                "damage": "1d4",
                "hurled": 0,
                "launched": 1,
                "cost": 2,
                "weight": 1
            }
        ],
        "unskilled_penalty": -4
    },
    "thief_skills": null,
    "turn_undead_matrix": null,
    "spells": {
        "ill": {
            "spells_per_day": {
                "lvl1": 5,
                "lvl2": 4,
                "lvl3": 3,
                "lvl4": 2,
                "lvl5": 1,
                "lvl6": 0
            },
            "spells_known": [
                {
                    "school": "ill",
                    "spell_level": 1,
                    "spell_id": 23,
                    "spell_name": "Auditory Glamour",
                    "range": "240 feet",
                    "duration": "1 turn",
                    "reversible": false,
                    "pp": 178,
                    "spell_desc": "<p>A hallucination of sound is created, that of voices, calls, or cries (human, humanoid, animal, or monster); footfalls; or other like noises. The sounds of 1d4 creatures can be invented thus for each CA level of the sorcerer. However, if a sound is of significant volume, the referee must decide on the number of voices and their collective volume (e.g., the roar of one lion may be equal to the shouts of five people).</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 1,
                    "spell_id": 96,
                    "spell_name": "Darkness",
                    "range": "120 feet",
                    "duration": "6 turns (1 hour)",
                    "reversible": false,
                    "pp": 190,
                    "spell_desc": "<p>Evokes magical blackness to consume a 15-foot radius from its selected target point. Torch and lantern light are rendered ineffective, and <i>infrared vision</i> is futile. If <i>darkness</i> is cast on an unwilling creature, a <i>sorcery</i> saving throw is allowed to negate the spell. Creatures affected by <i>darkness</i> suffer effects similar to blindness: automatic loss of initiative and −4 penalties on attack rolls, armour class, and saving throws. <i>Darkness</i> can counter <i>continuous light</i> and <i>light</i>.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 1,
                    "spell_id": 113,
                    "spell_name": "Detect Silence",
                    "range": "120 feet",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 192,
                    "spell_desc": "<p>Allows the caster to hear that which is magically <i>silenced</i> or <i>moving silently</i> (thieves, barbarians, assassins, et al.) in a 120-foot radius. The spell attunes the caster to subtleties of sound otherwise imperceptible, such as a whisper behind a closed door. If the caster enters a deep trance, <i>detect silence</i> can also be used to perceive noises made in parallel dimensions.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 1,
                    "spell_id": 303,
                    "spell_name": "Prismatic Orb",
                    "range": "0",
                    "duration": "instantaneous",
                    "reversible": false,
                    "pp": 220,
                    "spell_desc": "<p>The illusionist creates a glowing, palm-sized sphere of energy based on one of the seven colours of the visible spectrum. The <i>prismatic orb</i> may be hurled up to 30 feet at a single foe. This functions as a missile attack roll with a bonus +2 “to hit” against the target’s armour class. The colour of orb conjured is determined randomly by a d8; a result of <i>8</i> indicates a special orb that cycles rapidly between two colours, delivering the effects of both colours.</p> <p><table> <caption><b>Table 107: Prismatic Orb Effects</b></caption> <tr><th>d8 Result</th> <th>Prismatic Orb Effect</th></tr> <tr><td>1</td> <td>Red orb that inflicts 1 hp of burning damage per CA level.</td></tr> <tr><td>2</td> <td>Orange orb that inflicts 2 hp burning damage per CA level.</td></tr> <tr><td>3</td> <td>Yellow orb that partially blinds the visual organs of the target as per a <i>light</i> spell (−2 “to hit,” −2 AC, and −2 saving throws; <i>sorcery</i> saving throw negates); duration is 1d2 + CA level in rounds.</td></tr> <tr><td>4</td> <td>Green orb that sickens target for 2d4 rounds unless a <i>death</i> (poison) save is made; –2 “to hit” and saving throws.</td></tr> <tr><td>5</td> <td>Blue orb that inflicts effects similar to a <i>chill touch</i> spell; <i>sorcery</i> saving throw or victim suffers 1d4 hp of energy-sapping damage and is penalized –1 “to hit” and damage rolls for 1d2 + CA level in rounds.</td></tr> <tr><td>6</td> <td>Indigo orb that causes the target to wander about confused for 1d6 rounds; <i>sorcery</i> saving throw modified by <i>willpower adjustment</i> (if applicable) negates the spell.</td></tr> <tr><td>7</td> <td>Violet orb that shoves the target with 10 pounds of force per CA level (cf. <i>shove</i> spell) unless a <i>sorcery</i> save is made.</td></tr> <tr><td>8</td> <td>Two colours: Roll twice, ignoring results of 8.</td></tr> </table></p> <p>A <i>prismatic orb</i> may not be hurled through barriers and will return to the caster’s palm up to three times if it misses its intended target; however, each time it returns to the caster’s palm, a (possibly) new colour(s) takes form; i.e., a d8 must be rolled again. A returned orb must be hurled on the next round or it disappears.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 2,
                    "spell_id": 11,
                    "spell_name": "Alter Self",
                    "range": "0",
                    "duration": "1d6 turns",
                    "reversible": false,
                    "pp": 176,
                    "spell_desc": "<p>The sorcerer’s form is mutated to something or someone no more than 50% smaller or larger, lighter or heavier. The new form has quasi-actuality. For example, if the new form has wings, the caster is allowed minimal flight, moving at no greater than 50% of the actual creature’s speed; if the creature has gills, the caster can breathe underwater; and so on. The altered form is limited to humans, humanoids, or other bipedal species with which the caster is familiar. This spell does not grant any special abilities beyond locomotion and respiration—no innate magical abilities, no enhanced acuity. The duration of the spell should be rolled in secret by the referee.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 2,
                    "spell_id": 447,
                    "spell_name": "Whispering Wind",
                    "range": "5 miles per CA level",
                    "duration": "special",
                    "reversible": false,
                    "pp": 246,
                    "spell_desc": "<p>Evokes a gentle breeze to whirl around the sorcerer and then depart, taking with it a spoken message no more than 12 words (not including articles <i>a</i>, <i>an</i>, and <i>the</i>). The message will be conveyed to a familiar recipient within the spell’s range, so long as no insurmountable obstacles prevent delivery. If the caster and the subject are both outdoors, the spell is almost always successful; however, if one or the other is in a dungeon or inside a building, obstructions (e.g., walls, closed doors) can preclude the spell from functioning as desired. When the <i>whispering wind</i> reaches its objective, it swirls about the recipient creature and softly murmurs its message.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 3,
                    "spell_id": 452,
                    "spell_name": "Wraithshape",
                    "range": "0",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 246,
                    "spell_desc": "<p>The sorcerer and all gear assume a smoke-grey, incorporeal form. Whilst in <i>wraithshape</i>, the undead (except <b>vampires</b> and <b>liches</b>) will ignore the caster, believing him or her to be one of their own abysmal kind. The sorcerer can squeeze under doors or through small holes or cracks, and he can float in the air at 15 MV. Only magical weapons or spells can harm such a sorcerer. The sorcerer cannot, however, make any attacks unless confronted by a creature in a like state. <i>Dispel magic</i> breaks the spell; otherwise, the sorcerer can terminate it at will.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 3,
                    "spell_id": 412,
                    "spell_name": "Tongues",
                    "range": "0",
                    "duration": "1 turn",
                    "reversible": true,
                    "pp": 240,
                    "spell_desc": "<p>Enables the sorcerer to speak the language of any intelligent creature within 50 feet, including secret languages such as Druidic or Thieves’ Cant. Once the spell’s duration ends, the caster retains no knowledge or memory of otherwise unknown languages. The reverse of this spell, <i>gibberish</i>, confuses and jumbles the words of all speakers within 50 feet (except those of the caster), pending individual <i>sorcery</i> saving throws, modified by <i>willpower adjustment</i>, if applicable. Spells may also be jumbled to ineffectiveness, but this allows for a second <i>sorcery</i> saving throw, with +1 for every CA level of the opposing caster.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 4,
                    "spell_id": 362,
                    "spell_name": "Solid Fog",
                    "range": "30 feet",
                    "duration": "12 rounds (2 minutes)",
                    "reversible": false,
                    "pp": 231,
                    "spell_desc": "<p>Creates a cloud as large as 10 feet thick, 30 feet long, and 30 feet high. Only a gale-force wind (35 mph or greater) disperses this spell; even a <i>gust of wind</i> spell is insufficient. Any creature within or attempting to traverse the <i>solid fog</i> is slowed by the fog’s density to a maximum rate of 10 MV. Normal sight cannot penetrate <i>solid fog</i>, and <i>infrared vision</i> is unavailing. Potent fire spells such as <i>fireball</i>, <i>flame strike</i>, or <i>wall of fire</i> burn away <i>solid fog</i> in 1 round.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 4,
                    "spell_id": 147,
                    "spell_name": "False Vacancy",
                    "range": "10 feet per CA level",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 196,
                    "spell_desc": "<p>Creates a potent illusion that causes an area to appear empty, unoccupied, and/or neglected. The affected area can be 10 feet in diameter per CA level. <i>False vacancy</i> is a combination of <i>invisibility</i> and <i>phantasm</i>, but it cannot mask living creatures. The details of <i>false vacancy</i> are up to the sorcerer. Observers might, for example, see a treasure room as a dusty, cobweb-filled chamber containing a few broken pieces of furniture. If a group passes through the dweomered area, the illusion will adapt to their passage: Cobwebs will float, dusty footprints will be left in their wake, and so forth. Unless a masked object is touched by an investigating creature, the area will seem empty of what it actually contains.</p> <p>If the real contents of the masked area are forcibly shaken or handled roughly, the creature doing so may make a <i>sorcery</i> saving throw, modified by <i>willpower adjustment</i>, if applicable. If successful, the illusion will begin to shimmer, and the invisible object is revealed. If the saving throw fails, the subject believes that contact was made with an invisible object. Note that casual and careful touching of masked objects is not cause for a saving throw because the illusion cannot be disrupted unless handled with force. <i>Dispel phantasm</i> can break this spell, revealing that which is concealed by the illusion, but <i>dispel magic</i> and <i>detect invisibility</i> are ineffective.</p>"
                },
                {
                    "school": "ill",
                    "spell_level": 5,
                    "spell_id": 4,
                    "spell_name": "Advanced Spectral Phantasm",
                    "range": "240 feet",
                    "duration": "permanent",
                    "reversible": false,
                    "pp": 175,
                    "spell_desc": "<p>A visual illusion is created, a projected image of nearly anything the caster can imagine, as large as 50 × 50 × 50 feet in area. Victims must be living creatures of animal intelligence or greater; undead, constructs, oozes, and the like are unaffected. <i>Advanced spectral phantasm</i> can be used to create an attacking monster or another damaging hazard. The illusion can be of sight, sound, smell, and/or temperature. The auditory component might include a shout, a roar, or a sentence of no more than nine words in length (not including articles <i>a</i>, <i>an</i>, and <i>the</i>).</p> <p>Once cast, this spell will persist infinitely, with no need of concentration unless the caster wishes to manipulate the movements of the illusion; such manoeuvres require full concentration, though the sorcerer can walk at half speed and maintain control. The illusion is broken if struck for 1 hp damage or more, or it can be terminated via a <i>dispel phantasm</i> spell. An <i>advanced spectral phantasmal</i> monster is AC 6 and will disappear if hit; otherwise, it can continue to attack without caster direction.</p> <p><i>Advanced spectral phantasm</i> targets are not allowed saving throws unless the referee feels the illusion is unbelievable to its viewers, in which case <i>sorcery</i> saving throws should be rolled, modified by <i>willpower adjustment</i>, if applicable. With sight, sound, smell, and/or temperature, credibility is rarely an issue with this spell; if such a case arises, and the save is made, the disbeliever will see the <i>advanced spectral phantasm</i> as a flawed and flickering transparent image. An intelligent disbeliever may then alert allies, whose saves are made at a bonus of +4. Otherwise, this illusion can inflict real physical damage: 1d8 hp per CA level per round to each victim. Such damage remains even if the spell is subsequently broken.</p>"
                }
            ]
        }
    },
    "class_abilities": [
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Alchemy",
            "brief_desc": "identify potions by taste",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Coloured Globe",
            "brief_desc": "conjure 6\" diameter globe 1/day/level",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Extraordinary",
            "brief_desc": "+8% feat of DX",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Read Magic",
            "brief_desc": "decipher magical inscriptions",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Scroll Use",
            "brief_desc": "decipher and invoke illusionist scrolls",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Scroll Writing",
            "brief_desc": "scribe a known spell onto a scroll",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Sorcery",
            "brief_desc": "cast illusionist spells",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 1,
            "ability_title": "Vizard",
            "brief_desc": "alter countenance for 1 turn",
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 4,
            "ability_title": "New Weapon Skill",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 6,
            "ability_title": "Enlist Henchmen",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 8,
            "ability_title": "New Weapon Skill",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 13,
            "level": 9,
            "ability_title": "Lordship",
            "brief_desc": null,
            "ability_desc": null
        }
    ]
}
