{
    "app_version": "0.3.10",
    "method": 6,
    "class_id": 16,
    "class_name": "Witch",
    "attr": {
        "st": {
            "score": 9,
            "atk_mod": 0,
            "dmg_adj": 0,
            "test": 2,
            "feat": 4
        },
        "dx": {
            "score": 10,
            "atk_mod": 0,
            "def_adj": 0,
            "test": 2,
            "feat": 4
        },
        "cn": {
            "score": 11,
            "hp_adj": 0,
            "poison_adj": 0,
            "trauma_surv": 75,
            "test": 2,
            "feat": 4
        },
        "in": {
            "score": 12,
            "lang": 0,
            "bonus_spells": 0,
            "learn_spell": 50
        },
        "ws": {
            "score": 14,
            "will_adj": 0,
            "bonus_spells": 1,
            "learn_spell": 65
        },
        "ch": {
            "score": 14,
            "react_adj": 1,
            "max_henchmen": 6,
            "turn_adj": 0
        }
    },
    "xp": 768000,
    "level": 11,
    "xp_to_next": 960000,
    "xp_bonus": false,
    "alignment": {
        "align_id": 5,
        "short_name": "N",
        "long_name": "Neutral"
    },
    "deity": {
        "deity_id": 7,
        "deity_name": "Helios",
        "primary_alignment": "Neutral"
    },
    "race_id": 12,
    "race": "Viking",
    "gender": "Female",
    "secondary_skill": "riverman/waterman",
    "hd": "9d4+2",
    "hp": 23,
    "fa": 5,
    "ca": 11,
    "ta": 0,
    "sv": 11,
    "sv_bonus": {
        "death": 0,
        "transformation": 2,
        "device": 0,
        "avoidance": 0,
        "sorcery": 2
    },
    "combat_matrix": {
        "-9": 24,
        "-8": 23,
        "-7": 22,
        "-6": 21,
        "-5": 20,
        "-4": 19,
        "-3": 18,
        "-2": 17,
        "-1": 16,
        "0": 15,
        "1": 14,
        "2": 13,
        "3": 12,
        "4": 11,
        "5": 10,
        "6": 9,
        "7": 8,
        "8": 7,
        "9": 6
    },
    "name": "",
    "armour": {
        "armour_id": 1,
        "armour_type": "None",
        "ac": 9,
        "dr": 0,
        "weight_class": null,
        "mv": 40,
        "cost": null,
        "weight": null,
        "description": null
    },
    "shield": null,
    "ac": 9,
    "mv": 40,
    "weapons_melee": [
        {
            "weapon_id": 109,
            "weapon_type": "Silver Dagger",
            "wc": 1,
            "hurlable": true,
            "hurled_rof": "3/2",
            "range_sml": "10/20/30",
            "damage": "1d4",
            "damage_2h": null,
            "cost": 25,
            "weight": 1,
            "qty": 1,
            "atk_rate": "1/1",
            "melee_atk": 0,
            "hurled_atk": 0,
            "dmg_adj": 0,
            "mastery": false
        }
    ],
    "weapons_missile": [
        {
            "weapon_id": 208,
            "weapon_type": "Blowgun",
            "rof": "1/1",
            "range_sml": "30/60/90",
            "damage": "1",
            "hurled": false,
            "launched": true,
            "cost": 5,
            "weight": 1,
            "qty": 1,
            "ammunition": "blowgun needles ×10",
            "missile_atk": 0,
            "dmg_adj": 0,
            "mastery": false
        }
    ],
    "equipment": [
        "backpack",
        "bandages",
        "winter blanket",
        "beeswax candles ×2",
        "brass censer",
        "chalk (piece)",
        "incense sticks ×12",
        "ink and quill",
        "body paint (crock)",
        "parchment ×2",
        "soft leather pouch",
        "iron rations (1 week)",
        "wooden rattle",
        "hemp rope (50-ft.)",
        "small sack",
        "tinderbox",
        "torches ×3",
        "wineskin (full)",
        "wolfsbane",
        "writing stick",
        "spell book"
    ],
    "money": {
        "pp": 0,
        "gp": 2,
        "ep": 0,
        "sp": 0,
        "cp": 0
    },
    "favoured_weapons": {
        "any": false,
        "weapons_melee": [
            {
                "weapon_id": 108,
                "weapon_type": "Dagger",
                "wc": 1,
                "hurlable": 1,
                "hurled_rof": "3/2",
                "range_sml": "10/20/30",
                "damage": "1d4",
                "damage_2h": null,
                "cost": 4,
                "weight": 1
            },
            {
                "weapon_id": 126,
                "weapon_type": "Quarterstaff",
                "wc": 3,
                "hurlable": 0,
                "hurled_rof": null,
                "range_sml": null,
                "damage": "1d6",
                "damage_2h": null,
                "cost": 5,
                "weight": 5
            },
            {
                "weapon_id": 143,
                "weapon_type": "Whip",
                "wc": 5,
                "hurlable": 0,
                "hurled_rof": null,
                "range_sml": null,
                "damage": "1d2",
                "damage_2h": null,
                "cost": 1,
                "weight": 2
            }
        ],
        "weapons_missile": [
            {
                "weapon_id": 203,
                "weapon_type": "Dart",
                "rof": "2/1",
                "range_sml": "15/30/45",
                "damage": "1d3",
                "hurled": 1,
                "launched": 0,
                "cost": 1,
                "weight": 1
            },
            {
                "weapon_id": 208,
                "weapon_type": "Blowgun",
                "rof": "1/1",
                "range_sml": "30/60/90",
                "damage": "1",
                "hurled": 0,
                "launched": 1,
                "cost": 5,
                "weight": 1
            },
            {
                "weapon_id": 216,
                "weapon_type": "Sling",
                "rof": "1/1",
                "range_sml": "50/100/150",
                "damage": "1d4",
                "hurled": 0,
                "launched": 1,
                "cost": 2,
                "weight": 1
            }
        ],
        "unskilled_penalty": -4
    },
    "thief_skills": null,
    "turn_undead_matrix": null,
    "spells": {
        "wch": {
            "spells_per_day": {
                "lvl1": 6,
                "lvl2": 6,
                "lvl3": 5,
                "lvl4": 4,
                "lvl5": 3,
                "lvl6": 2
            },
            "spells_known": [
                {
                    "school": "wch",
                    "spell_level": 1,
                    "spell_id": 107,
                    "spell_name": "Detect Evil",
                    "range": "60 feet",
                    "duration": "1 turn",
                    "reversible": true,
                    "pp": 191,
                    "spell_desc": "<p>The sorcerer detects potent emanations of Evil in a 60-foot-long, 10-foot-wide path. Sources of Evil emanations might include Evil artefacts, dæmons, or the undead. <i>Detect evil</i> will not discern the alignment of other characters, even if they are Evil, unless the subject is of a pure and intense Evil (empowered by dæmons, for example) or is about to commit a most vile act. Clerics must brandish their holy symbols to cast this spell. From a stationary position the caster can slowly rotate, covering 360° before the spell ends. <i>Detect evil</i> is obstructed by metal of one-inch thickness, stone of six-inch thickness, or wood of one-foot thickness; lead completely foils the spell. Evil sorcerers cast the reverse version of this spell, <i>detect good</i>, which functions the same way with regard to emanations of Good.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 1,
                    "spell_id": 375,
                    "spell_name": "Spider Climb",
                    "range": "touch",
                    "duration": "6 turns (1 hour)",
                    "reversible": false,
                    "pp": 232,
                    "spell_desc": "<p>Allows the spell’s recipient to scale sheer or vertical surfaces, including those that are smooth and polished, like marble. The fingertips and toes of the climber become sticky, like those of a spider, with magical cilia providing adhesion. A <i>spider climb</i> recipient can climb up walls and move along ceilings at one-half their normal movement rate. Whilst climbing, the recipient cannot manipulate objects that weigh less than one pound because such objects will cling to the hands. Spell casters cannot cast other spells, but they can trigger magical devices. <i>N.B.:</i> Gauntlets and heavy footwear must be removed to benefit from this spell.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 1,
                    "spell_id": 180,
                    "spell_name": "Friends",
                    "range": "0",
                    "duration": "1 turn",
                    "reversible": false,
                    "pp": 201,
                    "spell_desc": "<p>The caster’s charisma score is improved by 2d4 points (to 18 maximum). Creatures who speak with the caster must make immediate <i>reaction rolls</i>, modified by the <i>reaction/loyalty adjustment</i> of the sorcerer’s improved charisma score. If the result is favourable (score of 9+), the caster is at once viewed as a charming and impressive person worthy of help, consideration, and support. The caster is convincing to those who are affected, so long as he or she is not overly abrasive. Once the spell’s duration has expired, those who were influenced by the caster will realize they were ensorcelled.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 1,
                    "spell_id": 238,
                    "spell_name": "Light",
                    "range": "120 feet",
                    "duration": "6 turns (1 hour)",
                    "reversible": false,
                    "pp": 211,
                    "spell_desc": "<p>Effects a 30-foot-diameter sphere of soft, lambent illuminance, somewhat dimmer than full daylight. The spell can be centred on an object, on a person, or in the air. If <i>light</i> is centred on the visual organs of a creature, and it fails a <i>sorcery</i> saving throw, the victim is partially blinded for the duration of the spell, suffering −2 “to hit,” −2 AC, and −2 saving throws. This spell can be ended at will by the caster. A <i>light</i> spell can counter a <i>darkness</i> spell, and vice versa, but not <i>continuous darkness</i>.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 2,
                    "spell_id": 113,
                    "spell_name": "Detect Silence",
                    "range": "120 feet",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 192,
                    "spell_desc": "<p>Allows the caster to hear that which is magically <i>silenced</i> or <i>moving silently</i> (thieves, barbarians, assassins, et al.) in a 120-foot radius. The spell attunes the caster to subtleties of sound otherwise imperceptible, such as a whisper behind a closed door. If the caster enters a deep trance, <i>detect silence</i> can also be used to perceive noises made in parallel dimensions.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 2,
                    "spell_id": 276,
                    "spell_name": "Obscure",
                    "range": "0",
                    "duration": "1 turn",
                    "reversible": false,
                    "pp": 216,
                    "spell_desc": "<p>Swirling, misty vapours surround the caster in a cubic area with sides up to 10 feet per CA level, as chosen by the caster; e.g., a CA 6 sorcerer <i>obscures</i> up to a 60 × 60 × 60-foot area. Within the <i>obscured</i> area, visibility is reduced to five feet, and spells such as <i>infrared vision</i> are ineffective. A strong wind reduces the duration of <i>obscure</i> by 90%; i.e., the 10-minute (1-turn) duration will be reduced to 1 minute (6 rounds).</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 3,
                    "spell_id": 72,
                    "spell_name": "Continuous Light",
                    "range": "120 feet",
                    "duration": "special",
                    "reversible": false,
                    "pp": 186,
                    "spell_desc": "<p>Creates a 60-foot-diameter sphere of lambent light, the subtle hue of which may be selected by the caster. It cannot be cast on a single target or object, but rather on an area. The effect is permanent (unless <i>dispelled</i>), so long as the caster remains within 10 miles; otherwise, the dweomer begins to dissipate in subtle degrees, ending in a number of months equal to the sorcerer’s CA. <i>Continuous light</i> can counter <i>continuous darkness</i> and <i>darkness</i>.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 3,
                    "spell_id": 452,
                    "spell_name": "Wraithshape",
                    "range": "0",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 246,
                    "spell_desc": "<p>The sorcerer and all gear assume a smoke-grey, incorporeal form. Whilst in <i>wraithshape</i>, the undead (except <b>vampires</b> and <b>liches</b>) will ignore the caster, believing him or her to be one of their own abysmal kind. The sorcerer can squeeze under doors or through small holes or cracks, and he can float in the air at 15 MV. Only magical weapons or spells can harm such a sorcerer. The sorcerer cannot, however, make any attacks unless confronted by a creature in a like state. <i>Dispel magic</i> breaks the spell; otherwise, the sorcerer can terminate it at will.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 4,
                    "spell_id": 269,
                    "spell_name": "Moonlight",
                    "range": "90 feet",
                    "duration": "6 turns (1 hour) per CA level",
                    "reversible": false,
                    "pp": 215,
                    "spell_desc": "<p>Illumes a 25-foot-diameter area with a moonbeam, the luminosity of which rivals that of a full moon; the effect is not unlike a spotlight. Soft light extends in a 25-foot radius beyond the spell’s area, so the entire effect (75-foot diameter in total) appears quite natural (when outdoors, of course). This spell does not interfere with <i>infrared vision</i>, though it can enhance <i>ultraviolet vision</i>.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 4,
                    "spell_id": 300,
                    "spell_name": "Polymorph Self",
                    "range": "0",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 220,
                    "spell_desc": "<p>The sorcerer transforms into any living creature of equal or lesser HD (though not a specific individual), from as small as a mouse to as large as a mammoth, so long as the caster is familiar with the desired shape. Upon transforming, the caster retains armour class, hit points, fighting ability, and saving throws. All possessions are melded with the new form, and the caster no longer realizes the benefits of any magical items, except for magical rings.</p> <p>The sorcerer acquires the natural physical abilities of the new form (e.g., a bear’s claw/claw/bite attacks, a falcon’s flight, a shark’s undersea breathing), but not special attacks (e.g., a snake’s venom, an eel’s electric shock) or defences (e.g., a dæmon’s <i>sorcery resistance</i>, a lycanthrope’s immunity to normal weapons). Unlike <i>polymorph other</i> victims, the caster retains his or her mental capacity, though is unable to speak as normal or cast other spells if the form is not humanoid. The sorcerer can terminate the spell at will without need of a <i>trauma survival</i> check; when the spell ends, the caster heals 2d6 hp of damage sustained (if applicable). If killed whilst <i>polymorphed</i>, the sorcerer’s true form will be revealed.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 5,
                    "spell_id": 76,
                    "spell_name": "Control Winds",
                    "range": "0",
                    "duration": "1 turn per CA level",
                    "reversible": false,
                    "pp": 186,
                    "spell_desc": "<p>This spell is cast outdoors, taking effect 1 turn after being incanted. A minute or so before the effect manifests, winds begin to swirl around the caster, rotating in a clockwise or counterclockwise direction. The sorcerer stands at the 15-foot-radius epicentre of the effect, where the air remains calm.</p> <p>Once the spell takes full effect, the winds develop into a <i>strong gale</i>, or a 60-mph average; the caster may designate a less potent wind force if desired. These winds extend in a 240-foot hemispherical radius around the caster, damaging buildings, bending or even uprooting trees, driving away flying creatures, and affecting sailed movement. The sorcerer can walk after casting the spell and need not concentrate on it; the epicentre of the winds moves with him or her. The caster can use this spell to control otherwise prevailing winds (natural or not) and can end the effect at will.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 5,
                    "spell_id": 394,
                    "spell_name": "Summon Dæmon III",
                    "range": "10 feet",
                    "duration": "6 rounds (1 minute) or special",
                    "reversible": false,
                    "pp": 235,
                    "spell_desc": "<p>Sorcery transports a <b>lesser dæmon</b> from Underborea as selected by the sorcerer, depending on need. The dæmon will arrive 1 round after the spell is cast and will perform its designated task, after which, dead or alive, it will either disappear or turn on the caster and/or any allies (see below). When casting this spell, the sorcerer must explicitly state the <i>summoned</i> type: “defender,” “illuminator,” or “seeker.”</p> <ul><li><b>Defender</b>: <i>Summons</i> a random dæmon to assault the sorcerer’s enemies as directed for no longer than 6 rounds. The target(s) must be pointed out straight away, or else the dæmon will attack the sorcerer and/or any allies. If the stated target(s) is defeated, the standard chance of betrayal applies. <p><table><caption><b>Table 115: Summon Dæmon III Spell</b></caption> <tr><th>d6 Result</th><th>Defender Summoned</th></tr> <tr><td>1–3</td><td>Dæmon, Lesser, Class xi (1)</td></tr> <tr><td>4–5</td><td>Dæmon, Lesser, Class xii (1)</td></tr> <tr><td>6</td><td>Dæmon, Lesser, Class xiii (1)</td></tr></table></p></li> <li><b>Illuminator</b>: <i>Summons</i> a single <b>class xiv lesser dæmon</b>. The beast can use its special <i>legend lore</i> ability to determine the whereabouts of an artefact, of which it will then inform the caster. If the artefact does not exist, the beast will attack the sorcerer and/or any comrades. Alternatively, it can be called upon to use its <i>tongues</i> ability to converse with any intelligent creature present. Lastly, it instead can grant wisdom by use of its <i>contact otherworldly being</i> ability, with no risk of insanity. No matter the case, once the dæmon has completed its service, the standard chance of betrayal applies; however, in the latter case (<i>contact otherworldly being</i>), each question beyond the first increases the dæmon’s chance of betrayal by 1-in-6.</li> <li><b>Seeker</b>: <i>Summons</i> a single <b>class xv lesser dæmon</b> to search and destroy. When the <i>seeker</i> type is designated, the sorcerer also must describe the prey (name, species, and so forth). The dæmon then will <i>teleport</i> itself and the sorcerer before said prey and attempt to slay it, after which the standard chance of betrayal applies. If no prey exists, the dæmon will attack the sorcerer and/or any comrades. Alternatively, this dæmon can be asked to <i>plane shift</i> the sorcerer and as many as five allies. This act of utter desperation cannot be undone by the same or another lesser dæmon; it is permanent, barring some other means of translocation. The dæmon then either will disappear (laughing all the while) or will turn on the sorcerer and any allies (q.v.).</li></ul> <p><i>Betrayal:</i> Dæmons are infamous for betrayal. Upon completing their prescribed task, they may turn on the sorcerer and/or any allies on a 1-in-6 chance. Dæmons are, however, subject to morale checks during the entire <i>summon dæmon</i> process. Those that fail will attempt to flee (if possible), now permanent inhabitants of Hyperborea that may one day seek revenge. Wise sorcerers are known to take sanctuary within the confines of a candlelit magic circle whilst casting and maintaining this spell; of course, the magic circle will only protect the sorcerer, not allies.</p>"
                },
                {
                    "school": "wch",
                    "spell_level": 6,
                    "spell_id": 179,
                    "spell_name": "Freezing Sphere",
                    "range": "special",
                    "duration": "special",
                    "reversible": false,
                    "pp": 201,
                    "spell_desc": "<p>This dweomer requires the sacrifice of a 500-gp sapphire. It evokes a two-inch-diameter sphere of bluewhite ice that appears in the palm of the caster and can be implemented in three different manners:</p> <ul><li><i>Ice Bullet:</i> The sphere can be hurled using the <i>flask hurling</i> rules (see <b>Chapter 9: Combat</b>, <i>combat options</i>) or launched from a sling as an <i>ice bullet</i>. Wherever it strikes, the <i>ice bullet</i> bursts, delivering 6d6 hp cold damage to all within a 20-foot radius of the blast. A <i>sorcery</i> saving throw is permitted for half damage.</li> <li><i>Ice Sheet:</i> The sphere can be tossed into a body of water such as a lake, pond, or river, effecting an <i>ice sheet</i> on the surface six inches in depth and covering 100 square feet per CA level. The <i>ice sheet</i> persists for as long as logic dictates, based on prevailing weather.</li> <li><i>Ray of Cold:</i> The sorcerer can pinch the sphere, releasing a thin <i>ray of cold</i> that extends 10 feet per CA level. The aimed <i>ray of cold</i> moves in a straight line and passes through all in its path, inflicting 4 hp damage per CA level. All damage is negated if <i>sorcery</i> saving throws are made.</li> <p>The <i>freezing sphere</i> can be held by the caster for 1 turn per CA level. If the caster does not use the sphere before then, it explodes as an <i>ice bullet</i> with no saving throw allowed.</p>"
                }
            ]
        }
    },
    "class_abilities": [
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Alchemy",
            "brief_desc": "identify potions by taste",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Brew Decoction",
            "brief_desc": "",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Familiar",
            "brief_desc": "magical animal companion. [Rat, 3 hp]",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Read Magic",
            "brief_desc": "decipher magical inscriptions",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Scroll Use",
            "brief_desc": "decipher and invoke witch scrolls",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Scroll Writing",
            "brief_desc": "scribe a known spell onto a scroll",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 1,
            "ability_title": "Sorcery",
            "brief_desc": "cast witch spells",
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 4,
            "ability_title": "New Weapon Skill",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 5,
            "ability_title": "Dance of Beguilement",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 5,
            "ability_title": "Effigy",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 6,
            "ability_title": "Enlist Henchmen",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 7,
            "ability_title": "Animate Broom",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 8,
            "ability_title": "New Weapon Skill",
            "brief_desc": null,
            "ability_desc": null
        },
        {
            "class_id": 16,
            "level": 9,
            "ability_title": "Lordship",
            "brief_desc": null,
            "ability_desc": null
        }
    ]
}
